# 1. Дана строка. Выведите её длину, первый и последний символы.
s = "Пример"
print(len(s), s[0], s[-1])

# 2. Выведите символ, стоящий в середине строки. Для строки чётной длины выведите оба средних.
s = "Пример"
print(s[len(s)//2] if len(s) % 2 else s[len(s)//2 - 1: len(s)//2 + 1])

# 3. Из строки получите: первые три символа, последние три, все символы с чётными индексами, строку в обратном порядке.
s = "ПримерСтроки"
print(s[:3], s[-3:], s[::2], s[::-1])

# 4. Дана строка. Выведите её в верхнем регистре, в нижнем регистре и с заглавной первой буквой.
s = "пример строки"
print(s.upper(), s.lower(), s.capitalize())

# 5. Дана строка и символ с. Выведите, есть ли с в строке, сколько раз он встречается и индекс первого вхождения.
s = "Пример строки"
c = "р"
print(c in s, s.count(c), s.find(c))

# 6. Дана строка. Замените в ней все пробелы на подчёркивания.
s = "Пример строки с пробелами"
print(s.replace(" ", "_"))

# Дана строка с лишними пробелами в начале и в конце. Удалите их и выведите длину результата.
s = "   Пример строки   "
print(len(s.strip()))

# 8. Дана строка из имени и фамилии через пробел.
# Выведите сначала фамилию, потом имя, а затем инициалы.
s = "Иван Иванов"
space = s.find(" ")
first_name = s[:space]
last_name = s[space + 1:]
initials = first_name[0] + "." + last_name[0] + "."
print(last_name, first_name, initials)

# 9. Дана строка. Определите, является ли она палиндромом без учёта регистра.
s = "А роза упала на лапу Азора"
clean = s.replace(" ", "").lower()
if clean == clean[::-1]:
    print("Палиндром")
else:
    print("Не Палиндром")

#Дана строка из слов через пробел. Выведите количество слов, первое слово и последнее слово.
s = "Пример строки из нескольких слов"
words = s.split()
print(len(words), words[0], words[-1])